#+Title: Storage: Files and Databases
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2025-05-16
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:1
#+STARTUP: beamer num

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH2025

* Examples (Python)
#+begin_src python :results output

my_file = open("file_name", "w")
my_file.write("Overwriting the file with some contents here")
my_file.close()

my_file = open("file_name", "a")
my_file.write("Appending some text")
my_file.close()

my_file = open("file_name", "r")
file_contents = my_file.read()
my_file.close()

print("File contains:", file_contents)
#+end_src

#+RESULTS:
: File contains: Overwriting the file with some contents hereAppending some text

** Add Exception handling
- In case e.g. a write fails (or your program fails), you will have a dangling file handle
- There is a nicer construct for this, i.e. =with ... as:=

#+begin_src python :results output
  with open("file_name", "r") as my_file:
      print(my_file.read())
#+end_src

#+RESULTS:
: Overwriting the file with some contents hereAppending some text

** Reading single lines
- =file.read()= reads the entire file.
- Two other options, =readline()= or =for line in file=

#+begin_src python :results output
  # Option 1, "for line in file"
  with open("example_manylines.txt", "r") as my_file:
      for line in my_file:
          print(line.strip())

  # Option 2, readline()
  with open("example_manylines.txt", "r") as my_file:
      line = my_file.readline()
      while line:
          print(line.strip())
          line = my_file.readline()
#+end_src

#+RESULTS:
#+begin_example
Question Does it Swim?
Question Does it have flippers?
Animal seal
Animal fish
Animal bird

Question Does it Swim?
Question Does it have flippers?
Animal seal
Animal fish
Animal bird

#+end_example
